In [188]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from pandas import Series, DataFrame

In [189]:
students = {
    'Name': ['Sandip', 'Jane', 'Peter', 'Parker', 'Tony'],
    'Physics': [97, 99, 89, 100, 88],
    'Chemistry': [93, 94, 95, 85, 89],
    'Roll': [10, 11, 12, 45, 2]
}
df1 = DataFrame(students)
df1

   Chemistry    Name  Physics  Roll
0         93  Sandip       97    10
1         94    Jane       99    11
2         95   Peter       89    12
3         85  Parker      100    45
4         89    Tony       88     2

In [190]:
print type(df1)
print df1.index
print df1.columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=5, step=1)
Index([u'Chemistry', u'Name', u'Physics', u'Roll'], dtype='object')

In [191]:
df2 = DataFrame(students, columns=['Name', 'Physics', 'Chemistry'], index=students['Roll'])
df2.index.name = 'Roll'
sorted_df2 = df2.sort_index()
# sorted_values = df2.sort_values('Physics', ascending=False)
# sorted_values
sorted_df2

        Name  Physics  Chemistry
Roll
2       Tony       88         89
10    Sandip       97         93
11      Jane       99         94
12     Peter       89         95
45    Parker      100         85

In [192]:
2 in sorted_df2.index # checking existence in indexes

True

In [193]:
print sorted_df2.loc[10]
print sorted_df2.loc[10]['Physics']

Name         Sandip
Physics          97
Chemistry        93
Name: 10, dtype: object
97

In [194]:
sorted_df2.iloc[1]  # arrya like index based location

Name         Sandip
Physics          97
Chemistry        93
Name: 10, dtype: object

In [195]:
print sorted_df2[['Physics', 'Chemistry']]

      Physics  Chemistry
Roll
2          88         89
10         97         93
11         99         94
12         89         95
45        100         85

In [196]:
# slicing
first_three_student = sorted_df2[:3]
first_three_student['Chemistry']

Roll
2     89
10    93
11    94
Name: Chemistry, dtype: int64

In [197]:
print sorted_df2.loc[11:45, ['Name']]  # location based indexing along with associated columns values

print sorted_df2.iloc[0:3][['Name', 'Physics']]  # index based indexing along with associated columns values

        Name
Roll
11      Jane
12     Peter
45    Parker
        Name  Physics
Roll
2       Tony       88
10    Sandip       97
11      Jane       99

In [198]:
# Method 1: Array based # Not preferred
'''maths = [75, 45, 37, 93, 45]
sorted_df2['Maths'] = maths
sorted_df2
'''
# Method
maths = Series({2: 75, 10:45, 11:37, 12:93, 41: 89})
sorted_df2['Maths'] = maths
sorted_df2

        Name  Physics  Chemistry  Maths
Roll
2       Tony       88         89   75.0
10    Sandip       97         93   45.0
11      Jane       99         94   37.0
12     Peter       89         95   93.0
45    Parker      100         85    NaN

In [199]:
sorted_df2.dtypes

Name          object
Physics        int64
Chemistry      int64
Maths        float64
dtype: object

In [200]:
cleaned_data = sorted_df2[sorted_df2.notnull()['Maths']]
print cleaned_data

        Name  Physics  Chemistry  Maths
Roll
2       Tony       88         89   75.0
10    Sandip       97         93   45.0
11      Jane       99         94   37.0
12     Peter       89         95   93.0

In [201]:
pcm = cleaned_data.sum(axis=1).copy()
print pcm
cleaned_data['Total'] = pcm
print cleaned_data

Roll
2     252.0
10    235.0
11    230.0
12    277.0
dtype: float64
        Name  Physics  Chemistry  Maths  Total
Roll
2       Tony       88         89   75.0  252.0
10    Sandip       97         93   45.0  235.0
11      Jane       99         94   37.0  230.0
12     Peter       89         95   93.0  277.0

/home/sandip/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [203]:
cleaned_data
print cleaned_data.mean(axis=0)

Physics       93.25
Chemistry     92.75
Maths         62.50
Total        248.50
dtype: float64

In [221]:
print cleaned_data.describe()
print cleaned_data[['Physics', 'Maths']].describe()  # selected columns only
print cleaned_data[['Total']].describe().loc['mean']  # selected column's selected index only

         Physics  Chemistry      Maths       Total
count   4.000000   4.000000   4.000000    4.000000
mean   93.250000  92.750000  62.500000  248.500000
std     5.560276   2.629956  26.095977   21.205345
min    88.000000  89.000000  37.000000  230.000000
25%    88.750000  92.000000  43.000000  233.750000
50%    93.000000  93.500000  60.000000  243.500000
75%    97.500000  94.250000  79.500000  258.250000
max    99.000000  95.000000  93.000000  277.000000
         Physics      Maths
count   4.000000   4.000000
mean   93.250000  62.500000
std     5.560276  26.095977
min    88.000000  37.000000
25%    88.750000  43.000000
50%    93.000000  60.000000
75%    97.500000  79.500000
max    99.000000  93.000000
Total    248.5
Name: mean, dtype: float64

In [256]:
students_2 = {
    'Physics': [97, 99],
    'Chemistry': [93, 89],
    'Maths': [86, 81],
    'Roll': [101, 102]
}
df3 = DataFrame(students_2, columns=['Physics', 'Chemistry', 'Maths'], index=students_2['Roll'])
df3

     Physics  Chemistry  Maths
101       97         93     86
102       99         89     81

In [268]:
cd = pd.concat([cleaned_data, df3])
print cd

print '*****************'

fil_names = cd['Name'].fillna('Missing')
cd['Name'] = fil_names
print cd

print '*****************'

scd = cd.sort_index()
print scd

rscd = scd.reindex(columns=['Name','Physics','Chemistry','Maths','Total'])
print rscd

     Chemistry  Maths    Name  Physics  Total
2           89   75.0    Tony       88  252.0
10          93   45.0  Sandip       97  235.0
11          94   37.0    Jane       99  230.0
12          95   93.0   Peter       89  277.0
101         93   86.0     NaN       97    NaN
102         89   81.0     NaN       99    NaN
*****************
     Chemistry  Maths     Name  Physics  Total
2           89   75.0     Tony       88  252.0
10          93   45.0   Sandip       97  235.0
11          94   37.0     Jane       99  230.0
12          95   93.0    Peter       89  277.0
101         93   86.0  Missing       97    NaN
102         89   81.0  Missing       99    NaN
*****************
     Chemistry  Maths     Name  Physics  Total
2           89   75.0     Tony       88  252.0
10          93   45.0   Sandip       97  235.0
11          94   37.0     Jane       99  230.0
12          95   93.0    Peter       89  277.0
101         93   86.0  Missing       97    NaN
102         89   81.0  Missing       99    NaN
        Name  Physics  Chemistry  Maths  Total
2       Tony       88         89   75.0  252.0
10    Sandip       97         93   45.0  235.0
11      Jane       99         94   37.0  230.0
12     Peter       89         95   93.0  277.0
101  Missing       97         93   86.0    NaN
102  Missing       99         89   81.0    NaN

In [269]:
print rscd
rscd.loc[[101,102], 'Total'] = rscd[['Physics','Chemistry','Maths']].sum(axis=1) # Filling up Total
print rscd

        Name  Physics  Chemistry  Maths  Total
2       Tony       88         89   75.0  252.0
10    Sandip       97         93   45.0  235.0
11      Jane       99         94   37.0  230.0
12     Peter       89         95   93.0  277.0
101  Missing       97         93   86.0    NaN
102  Missing       99         89   81.0    NaN
        Name  Physics  Chemistry  Maths  Total
2       Tony       88         89   75.0  252.0
10    Sandip       97         93   45.0  235.0
11      Jane       99         94   37.0  230.0
12     Peter       89         95   93.0  277.0
101  Missing       97         93   86.0  276.0
102  Missing       99         89   81.0  269.0